//
// Momentan sind in dieser Datei noch einige Deutsche Texte, diese sind nur für den Moment, bis sie korrekt in Englisch geschrieben wurden.
//

//Für den Schlüssel-Status
"Invalid" = "Ungültig";
"Revoked" = "Widerrufen";
"Expired" = "Abgelaufen"; //Welches Wort währe passender?
"Disabled" = "Deaktiviert";
Key_Is_OK = "OK";

//Für die Lösch-Dialoge
"Delete secret key only" = "Nur geheimen Schlüssel löschen";
"Delete both" = "Beide löschen";
"Delete key" = "Schlüssel löschen";
DeleteSecretKey_Title = "Geheimen Schlüssel löschen";
DeleteSecretKey_Msg = "Möchten Sie den geheimen Schlüssel \"%@\", %@ wirklich löschen?\nWenn Sie dies tun, werden Sie nicht länger in der lage sein Nachrichten zu entschlüsseln, die für diesen Schlüssel verschlüsselt wurden!";
DeleteKey_Title = "Schlüssel löschen";
DeleteKey_Msg = "Möchten Sie den Schlüssel \"%@\", %@ wirklich löschen?";


//Für den Export, als standard Dateiname.
"untitled" = "unbenannt";


//Für die Schlüselsuche
"No keys Found" = "Keine Schlüssel gefunden";
"  %@ bit %@ key %@, created: %@\n\n" = "%@ bit %@ Schlüssel %@, erstellt: %@\n\n"; //Format für die gefundenen Schlüssel vom Server.


GenerateEntropy_Msg = "Wir müssen eine ganze Menge Zufallswerte erzeugen.  Sie können dies unterstützen, indem Sie z.B. in einem anderen Fenster irgendetwas tippen, die Maus verwenden oder irgendwelche anderen Programme benutzen.";
GenerateSubkey_Msg = "Zusätzlichen Unterschlüssel für den Schlüssel \"%@\", %@ anlegen.";
GenerateUserID_Msg = "Zusätzliche Benutzer-ID für den Schlüssel \"%@\", %@ anlegen.";
GenerateSignature_Msg = "Beglaubigung aller Benutzer-IDs von \"%@\", %@";
GenerateUidSignature_Msg = "Beglaubigung der Benutzer-ID \"%@\", %@";

ChangeExpirationDate_Msg = "Ändern des Verfalldatums von \"%@\", %@";
ChangeSubkeyExpirationDate_Msg = "Ändern des Verfalldatums des Unterschlüssels: %@ von \"%@\", %@";


//Meldungen wenn die Eingabe nicht korrekt war.
CheckError_NameToShort = "Der Name muss mindestens 5 Zeichen lang sein!!";
CheckError_NameToLong = "Der Name ist zu lang!";
CheckError_InvalidCharInName = "Ungültiges Zeichen im Namen!\n\"<\" und \">\" sind nicht erlaubt.";
CheckError_NameStartWithDigit = "Der Name darf nicht mit einer Zahl beginnen!";
CheckError_InvalidEmail = "Die E-Mail Adresse ist nicht gültig!";
CheckError_EmailToLong = "Die E-Mail Adresse ist zu lang!\nDie E-Mail Adresse darf höchstens 254 Zeichen lang sein.";
CheckError_InvalidCharInComment = "Ungültiges Zeichen im Kommentar!\n\"(\" und \")\" sind nicht erlaubt.";
CheckError_CommentToLong = "Der Kommentar ist zu lang!";
CheckError_NoKeyID = "Bitte geben Sie ein gültige Schlüssel-ID ein!";
CheckError_PassphraseMissmatch = "Die eingegebenen Passphrasen stimmen nicht überein!";


//Meldungen beim Start, wenn es Probleme gibt. 
GPGNotFound_Msg = "GPG2 konnte nicht gefunden werden!";
GPG1OnlyFound_Title = "GPG2 wurde nicht gefunden!";
GPG1OnlyFound_Msg = "Da zumindest GPG 1.4 gefunden wurde, sollten die meisten Funktionen verfügbar sein.";
GPGNotValid_Msg = "Keine kompatible GPG Version gefunden!";
GPGInitError_Msg = "GPG konnte nicht initialisiert werden!";
GPGAgentNotFound_Title = "gpg-agent wurde nicht gefunden!";
GPGAgentNotFound_Msg = "Ohne den gpg-agent können sie keine Passphrase geschützte Schlüssel verwenden.";
GPGAgentNotStart_Title = "gpg-agent konnte nicht gestartet werden!";
GPGAgentNotStart_Msg = "Ohne den gpg-agent können sie keine Passphrase geschützte Schlüssel verwenden.";
Quit_Button = "Beenden";


//Sollte klar sein.
No = "Nein";
Error = "Fehler";
Warning = "Warnung";
Cancle = "Abbrechen";


//Für die Importergebnis
"key %@: secret key imported\n" = "Schlüssel %@: geheimer Schlüssel importiert\n";
"key %@: public key \"%@\" imported\n" = "Schlüssel %@: öffentlicher Schlüssel \"%@\" importiert\n";
"key %@: \"%@\" new user ID(s)\n" = "Schlüssel %@: \"%@\" neue Benutzer-ID(s)\n";
"key %@: \"%@\" new signature(s)\n" = "Schlüssel %@: \"%@\" neue Beglaubigung(en)\n";
"key %@: \"%@\" new subkey(s)\n" = "Schlüssel %@: \"%@\" neue(r) Unterschlüssel\n";
"Nothing imported!" = "Nichts importiert!";


//Die verschiedenen Algorithmen
GPG_RSAAlgorithm = "RSA";
GPG_RSAEncryptOnlyAlgorithm = "RSA-E";
GPG_RSASignOnlyAlgorithm = "RSA-S";
GPG_ElgamalEncryptOnlyAlgorithm = "ELG-E";
GPG_DSAAlgorithm = "DSA";
GPG_EllipticCurveAlgorithm = "EllipticCurve";
GPG_ECDSAAlgorithm = "ECDSA";
GPG_ElgamalAlgorithm = "ELG";
GPG_DiffieHellmanAlgorithm = "DiffieHellman";


//Im Hauptfenster.
"%i of %i keys listed" = "%i von %i Schlüsseln angezeigt";


